def field_formation(original_text, anonymized_text, clean_text, tokens, lemmas, entities_dict):
    """
    Итак щас все объясню
    1)Первое это оригинальный текст который мы получаем. Мы с ним пока что ничего не делали
    2)Второе это текст где мы уже выделили наши сущности а именно почту, номера, даты и т д.
    3)Третье это отчищенный текст. Проще говоря это текст без сущностей
    4)Четвертое это тоже самое по сути что и третье только мы разбили наш текст на отдельные слова
    5)Пятое это где мы токены перевели в начальную форму слова.
    6)Шестое это по сути все наши найденные сущности.
    Я честно не уверен нужно ли нам по сути это потому что практического применения я не вижу 
    но в примере от препода я видел как было такое разделение так что пусть будет. 
    Никита, если эта фигня не нужна то можешь просто удалить ее.
    А и еще кое что. Я уверен что ребята скорее всего переменные по другому назвали так что 
    поменяй названия их
    """
    field = {
        "original_text": original_text,
        "anonymized_text": anonymized_text,
        "clean_text": clean_text,
        "tokens": tokens,
        "lemmas": lemmas,
        """Если что дальше начинаются сущности которые возможно не нужны.
        Тут они немного по другому написаны так как по сути мы обращаемся в словарь словаря так что вот. 
        Чтоб не выдавало ошибку когда нет сущности какой либо он будет выводить словарь пустой
        """
        "urls": entities_dict.get("urls", []),
        "phones": entities_dict.get("phones", []),
        "emails": entities_dict.get("emails", []),
        "dates": entities_dict.get("dates", []),
        "prices": entities_dict.get("prices", [])
    }
    return field
